# ---------------------------------------------------------------------------- #
#            DESAFIO Crie uma função em python que faça uma saudação           #
# ---------------------------------------------------------------------------- #
# ---------------------- Passo 1 - Criação das variáveis --------------------- #
n = input
i = input
# ------------------------ Passo 2 - Criação da Função ----------------------- #
def s():
    n = input ('Qual seu nome?')
    print(f'Olá {n} tudo bem?')
    i = input('Qual sua idade?')
    print(f'Entendi, então você tem {i} anos! ')
s()
# ---------------------------------------------------------------------------- #
#                              Exercício Concluído                             #
# ---------------------------------------------------------------------------- #